node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "enqueue_input/random_shuffle_queue"
  op: "RandomShuffleQueueV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 1024
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 256
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "enqueue_input/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_1"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_2"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_3"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/random_shuffle_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "enqueue_input/random_shuffle_queue"
  input: "enqueue_input/Placeholder"
  input: "enqueue_input/Placeholder_1"
  input: "enqueue_input/Placeholder_2"
  input: "enqueue_input/Placeholder_3"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "enqueue_input/Placeholder_4"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_5"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_6"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_7"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/random_shuffle_queue_EnqueueMany_1"
  op: "QueueEnqueueManyV2"
  input: "enqueue_input/random_shuffle_queue"
  input: "enqueue_input/Placeholder_4"
  input: "enqueue_input/Placeholder_5"
  input: "enqueue_input/Placeholder_6"
  input: "enqueue_input/Placeholder_7"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "enqueue_input/Placeholder_8"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_9"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_10"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_11"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/random_shuffle_queue_EnqueueMany_2"
  op: "QueueEnqueueManyV2"
  input: "enqueue_input/random_shuffle_queue"
  input: "enqueue_input/Placeholder_8"
  input: "enqueue_input/Placeholder_9"
  input: "enqueue_input/Placeholder_10"
  input: "enqueue_input/Placeholder_11"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "enqueue_input/Placeholder_12"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_13"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_14"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/Placeholder_15"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "enqueue_input/random_shuffle_queue_EnqueueMany_3"
  op: "QueueEnqueueManyV2"
  input: "enqueue_input/random_shuffle_queue"
  input: "enqueue_input/Placeholder_12"
  input: "enqueue_input/Placeholder_13"
  input: "enqueue_input/Placeholder_14"
  input: "enqueue_input/Placeholder_15"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "enqueue_input/random_shuffle_queue_Close"
  op: "QueueCloseV2"
  input: "enqueue_input/random_shuffle_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "enqueue_input/random_shuffle_queue_Close_1"
  op: "QueueCloseV2"
  input: "enqueue_input/random_shuffle_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "enqueue_input/random_shuffle_queue_Size"
  op: "QueueSizeV2"
  input: "enqueue_input/random_shuffle_queue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "enqueue_input/sub/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 256
      }
    }
  }
}
node {
  name: "enqueue_input/sub"
  op: "Sub"
  input: "enqueue_input/random_shuffle_queue_Size"
  input: "enqueue_input/sub/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "enqueue_input/Maximum/x"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "enqueue_input/Maximum"
  op: "Maximum"
  input: "enqueue_input/Maximum/x"
  input: "enqueue_input/sub"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "enqueue_input/Cast"
  op: "Cast"
  input: "enqueue_input/Maximum"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "enqueue_input/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0013020833721384406
      }
    }
  }
}
node {
  name: "enqueue_input/mul"
  op: "Mul"
  input: "enqueue_input/Cast"
  input: "enqueue_input/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "enqueue_input/queue/enqueue_input/random_shuffle_queuefraction_over_256_of_768_full/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "enqueue_input/queue/enqueue_input/random_shuffle_queuefraction_over_256_of_768_full"
      }
    }
  }
}
node {
  name: "enqueue_input/queue/enqueue_input/random_shuffle_queuefraction_over_256_of_768_full"
  op: "ScalarSummary"
  input: "enqueue_input/queue/enqueue_input/random_shuffle_queuefraction_over_256_of_768_full/tags"
  input: "enqueue_input/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "random_shuffle_queue_DequeueUpTo/n"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 64
      }
    }
  }
}
node {
  name: "random_shuffle_queue_DequeueUpTo"
  op: "QueueDequeueUpToV2"
  input: "enqueue_input/random_shuffle_queue"
  input: "random_shuffle_queue_DequeueUpTo/n"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: " "
      }
    }
  }
}
node {
  name: "StringSplit"
  op: "StringSplit"
  input: "random_shuffle_queue_DequeueUpTo:1"
  input: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 2
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
}
node {
  name: "mapping"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 62702
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 62702
          }
        }
        string_val: "this"
        string_val: "movie"
        string_val: "should"
        string_val: "not"
        string_val: "be"
        string_val: "watched"
        string_val: "as"
        string_val: "it"
        string_val: "was"
        string_val: "meant"
        string_val: "to"
        string_val: "a"
        string_val: "flop"
        string_val: "ram"
        string_val: "gopal"
        string_val: "verma"
        string_val: "first"
        string_val: "wanted"
        string_val: "make"
        string_val: "remake"
        string_val: "of"
        string_val: "classic"
        string_val: "bollywood"
        string_val: "sholay"
        string_val: "but"
        string_val: "after"
        string_val: "having"
        string_val: "problems"
        string_val: "with"
        string_val: "the"
        string_val: "original"
        string_val: "makers"
        string_val: "decided"
        string_val: "go"
        string_val: "ahead"
        string_val: "project"
        string_val: "and"
        string_val: "i"
        string_val: "guess"
        string_val: "leave"
        string_val: "all"
        string_val: "good"
        string_val: "parts"
        string_val: "acting"
        string_val: "script"
        string_val: "songs"
        string_val: "music"
        string_val: "comedy"
        string_val: "action"
        string_val: "etc"
        string_val: "out"
        string_val: "shoot"
        string_val: "just"
        string_val: "because"
        string_val: "he"
        string_val: "already"
        string_val: "happen"
        string_val: "hire"
        string_val: "crew"
        string_val: "waste"
        string_val: "money"
        string_val: "fact"
        string_val: "that"
        string_val: "entire"
        string_val: "says"
        string_val: "something"
        string_val: "about"
        string_val: "or"
        string_val: "me"
        string_val: "is"
        string_val: "terrible"
        string_val: "in"
        string_val: "way"
        string_val: "kept"
        string_val: "my"
        string_val: "attention"
        string_val: "perverse"
        string_val: "manner"
        string_val: "akin"
        string_val: "watching"
        string_val: "tragedy"
        string_val: "being"
        string_val: "able"
        string_val: "look"
        string_val: "away"
        string_val: "would"
        string_val: "have"
        string_val: "made"
        string_val: "great"
        string_val: "mst3k"
        string_val: "subject"
        string_val: "br"
        string_val: "most"
        string_val: "things"
        string_val: "enjoyable"
        string_val: "are"
        string_val: "here"
        string_val: "bad"
        string_val: "dialogue"
        string_val: "inappropriate"
        string_val: "contrived"
        string_val: "plot"
        string_val: "sequences"
        string_val: "ridiculous"
        string_val: "thank"
        string_val: "g"
        string_val: "d"
        string_val: "bombed"
        string_val: "we"
        string_val: "might"
        string_val: "get"
        string_val: "treated"
        string_val: "such"
        string_val: "delights"
        string_val: "skate"
        string_val: "fu"
        string_val: "where"
        string_val: "can"
        string_val: "see"
        string_val: "likes"
        string_val: "brian"
        string_val: "boitano"
        string_val: "performing"
        string_val: "triple"
        string_val: "lutz"
        string_val: "slashing"
        string_val: "guys"
        string_val: "ribbons"
        string_val: "his"
        string_val: "razor"
        string_val: "sharp"
        string_val: "skates"
        string_val: "digress"
        string_val: "one"
        string_val: "thing"
        string_val: "could"
        string_val: "helped"
        string_val: "turkey"
        string_val: "been"
        string_val: "little"
        string_val: "t"
        string_val: "from"
        string_val: "ms"
        string_val: "agbayani"
        string_val: "s"
        string_val: "like"
        string_val: "world"
        string_val: "seen"
        string_val: "anything"
        string_val: "new"
        string_val: "at"
        string_val: "least"
        string_val: "part"
        string_val: "who"
        string_val: "saw"
        string_val: "horrible"
        string_val: "cast"
        string_val: "cheap"
        string_val: "props"
        string_val: "ve"
        string_val: "lot"
        string_val: "better"
        string_val: "if"
        string_val: "set"
        string_val: "an"
        string_val: "parody"
        string_val: "style"
        string_val: "what"
        string_val: "starting"
        string_val: "name"
        string_val: "enemy"
        string_val: "naming"
        string_val: "contributing"
        string_val: "effect"
        string_val: "cop"
        string_val: "looking"
        string_val: "60"
        string_val: "year"
        string_val: "old"
        string_val: "player"
        string_val: "blond"
        string_val: "girl"
        string_val: "same"
        string_val: "blank"
        string_val: "boring"
        string_val: "on"
        string_val: "her"
        string_val: "face"
        string_val: "times"
        string_val: "towards"
        string_val: "end"
        string_val: "well"
        string_val: "m"
        string_val: "probably"
        string_val: "lambasted"
        string_val: "by"
        string_val: "everyone"
        string_val: "site"
        string_val: "earth"
        string_val: "worst"
        string_val: "structured"
        string_val: "films"
        string_val: "long"
        string_val: "time"
        string_val: "2"
        string_val: "half"
        string_val: "hour"
        string_val: "film"
        string_val: "feels"
        string_val: "its"
        string_val: "three"
        string_val: "has"
        string_val: "two"
        string_val: "tells"
        string_val: "story"
        string_val: "family"
        string_val: "move"
        string_val: "form"
        string_val: "their"
        string_val: "home"
        string_val: "drought"
        string_val: "famine"
        string_val: "they"
        string_val: "travel"
        string_val: "again"
        string_val: "yet"
        string_val: "another"
        string_val: "diane"
        string_val: "lane"
        string_val: "she"
        string_val: "cheats"
        string_val: "husband"
        string_val: "only"
        string_val: "role"
        string_val: "knows"
        string_val: "how"
        string_val: "play"
        string_val: "1969"
        string_val: "blouse"
        string_val: "man"
        string_val: "am"
        string_val: "so"
        string_val: "surprised"
        string_val: "very"
        string_val: "predictable"
        string_val: "then"
        string_val: "gets"
        string_val: "mad"
        string_val: "throws"
        string_val: "milk"
        string_val: "wouldn"
        string_val: "slept"
        string_val: "milkman"
        string_val: "really"
        string_val: "didn"
        string_val: "typical"
        string_val: "american"
        string_val: "sorry"
        string_val: "guy"
        string_val: "kind"
        string_val: "london"
        string_val: "monorail"
        string_val: "bank"
        string_val: "england"
        string_val: "did"
        string_val: "however"
        string_val: "tracy"
        string_val: "island"
        string_val: "thunderbirds"
        string_val: "themselves"
        string_val: "brits"
        string_val: "were"
        string_val: "baddies"
        string_val: "apart"
        string_val: "parker"
        string_val: "lady"
        string_val: "penelope"
        string_val: "up"
        string_val: "oh"
        string_val: "saying"
        string_val: "stuff"
        string_val: "forward"
        string_val: "show"
        string_val: "given"
        string_val: "quality"
        string_val: "actors"
        string_val: "scott"
        string_val: "brothers"
        string_val: "involved"
        string_val: "unfortunately"
        string_val: "hopes"
        string_val: "dashed"
        string_val: "led"
        string_val: "believe"
        string_val: "kgb"
        string_val: "group"
        string_val: "inept"
        string_val: "morons"
        string_val: "don"
        string_val: "clue"
        string_val: "doing"
        string_val: "point"
        string_val: "there"
        string_val: "laughable"
        string_val: "scene"
        string_val: "4"
        string_val: "agents"
        string_val: "couldn"
        string_val: "handle"
        string_val: "cia"
        string_val: "agent"
        string_val: "grow"
        string_val: "weary"
        string_val: "these"
        string_val: "biased"
        string_val: "sided"
        string_val: "perhaps"
        string_val: "genre"
        string_val: "nancy"
        string_val: "allen"
        string_val: "linda"
        string_val: "farentino"
        string_val: "c"
        string_val: "thomas"
        string_val: "also"
        string_val: "seemed"
        string_val: "uncomfortable"
        string_val: "seduced"
        string_val: "while"
        string_val: "marijuana"
        string_val: "why"
        string_val: "need"
        string_val: "included"
        string_val: "weakened"
        string_val: "considerably"
        string_val: "charac"
        string_val: "had"
        string_val: "more"
        string_val: "respect"
        string_val: "for"
        string_val: "relationship"
        string_val: "does"
        string_val: "try"
        string_val: "say"
        string_val: "much"
        string_val: "no"
        string_val: "kidding"
        string_val: "ever"
        string_val: "propose"
        string_val: "idea"
        string_val: "kicked"
        string_val: "studio"
        string_val: "serious"
        string_val: "movies"
        string_val: "exactly"
        string_val: "every"
        string_val: "consist"
        string_val: "traveling"
        string_val: "foreign"
        string_val: "locations"
        string_val: "problem"
        string_val: "which"
        string_val: "easily"
        string_val: "resolve"
        string_val: "hoping"
        string_val: "popular"
        string_val: "getting"
        string_val: "boyfriends"
        string_val: "think"
        string_val: "you"
        string_val: "starring"
        string_val: "them"
        string_val: "different"
        string_val: "contact"
        string_val: "tell"
        string_val: "apology"
        string_val: "absolutely"
        string_val: "nothing"
        string_val: "rachel"
        string_val: "griffiths"
        string_val: "must"
        string_val: "needed"
        string_val: "low"
        string_val: "budget"
        string_val: "lighting"
        string_val: "non"
        string_val: "existent"
        string_val: "vow"
        string_val: "pete"
        string_val: "postlesumthingor"
        string_val: "other"
        string_val: "ll"
        string_val: "commit"
        string_val: "suicide"
        string_val: "happy"
        string_val: "know"
        string_val: "1"
        string_val: "biggest"
        string_val: "regret"
        string_val: "wasted"
        string_val: "rubbish"
        string_val: "despite"
        string_val: "flaws"
        string_val: "enjoyed"
        string_val: "cigarette"
        string_val: "burns"
        string_val: "john"
        string_val: "carpenter"
        string_val: "season"
        string_val: "episode"
        string_val: "masters"
        string_val: "horror"
        string_val: "series"
        string_val: "yes"
        string_val: "cross"
        string_val: "between"
        string_val: "mouth"
        string_val: "madness"
        string_val: "8mm"
        string_val: "still"
        string_val: "quite"
        string_val: "constraints"
        string_val: "pro"
        string_val: "life"
        string_val: "definitely"
        string_val: "than"
        string_val: "else"
        string_val: "solid"
        string_val: "directing"
        string_val: "always"
        string_val: "houseboat"
        string_val: "often"
        string_val: "regarded"
        string_val: "australian"
        string_val: "described"
        string_val: "slasher"
        string_val: "carried"
        string_val: "promotion"
        string_val: "academy"
        string_val: "award"
        string_val: "underground"
        string_val: "disco"
        string_val: "band"
        string_val: "members"
        string_val: "begins"
        string_val: "die"
        string_val: "slashed"
        string_val: "death"
        string_val: "burned"
        string_val: "maniac"
        string_val: "attempting"
        string_val: "video"
        string_val: "remote"
        string_val: "lake"
        string_val: "outback"
        string_val: "badly"
        string_val: "acted"
        string_val: "written"
        string_val: "flick"
        string_val: "zero"
        string_val: "suspense"
        string_val: "annoying"
        string_val: "characters"
        string_val: "certainly"
        string_val: "delivers"
        string_val: "george"
        string_val: "isn"
        string_val: "funny"
        string_val: "kids"
        string_val: "snobby"
        string_val: "brats"
        string_val: "treats"
        string_val: "mother"
        string_val: "hispanic"
        string_val: "highly"
        string_val: "offended"
        string_val: "portrayed"
        string_val: "plus"
        string_val: "dysfunctional"
        string_val: "done"
        string_val: "once"
        string_val: "want"
        string_val: "makes"
        string_val: "when"
        string_val: "shows"
        string_val: "millions"
        string_val: "thought"
        string_val: "abc"
        string_val: "black"
        string_val: "angel"
        string_val: "minor"
        string_val: "whodunit"
        string_val: "june"
        string_val: "vincent"
        string_val: "woman"
        string_val: "trying"
        string_val: "save"
        string_val: "electric"
        string_val: "chair"
        string_val: "found"
        string_val: "guilty"
        string_val: "killing"
        string_val: "acquaintance"
        string_val: "dan"
        string_val: "duryea"
        string_val: "murdered"
        string_val: "decides"
        string_val: "help"
        string_val: "find"
        string_val: "real"
        string_val: "culprit"
        string_val: "peter"
        string_val: "lorre"
        string_val: "thankless"
        string_val: "suspect"
        string_val: "noir"
        string_val: "looks"
        string_val: "plays"
        string_val: "programmer"
        string_val: "never"
        string_val: "achieving"
        string_val: "special"
        string_val: "pleasant"
        string_val: "enough"
        string_val: "some"
        string_val: "stops"
        string_val: "enjoy"
        string_val: "deal"
        string_val: "super"
        string_val: "natural"
        string_val: "deep"
        string_val: "thoughts"
        string_val: "spiritual"
        string_val: "turned"
        string_val: "off"
        string_val: "far"
        string_val: "production"
        string_val: "direction"
        string_val: "into"
        string_val: "discussion"
        string_val: "big"
        string_val: "effort"
        string_val: "put"
        string_val: "screen"
        string_val: "namely"
        string_val: "mark"
        string_val: "addy"
        string_val: "garrett"
        string_val: "gave"
        string_val: "outstanding"
        string_val: "performance"
        string_val: "wife"
        string_val: "director"
        string_val: "worth"
        string_val: "wrong"
        string_val: "45"
        string_val: "minutes"
        string_val: "crawford"
        string_val: "young"
        string_val: "tone"
        string_val: "british"
        string_val: "speak"
        string_val: "accents"
        string_val: "impossible"
        string_val: "past"
        string_val: "hard"
        string_val: "talks"
        string_val: "accent"
        string_val: "chemistry"
        string_val: "anyone"
        string_val: "echo"
        string_val: "title"
        string_val: "ought"
        string_val: "baffles"
        string_val: "culture"
        string_val: "rich"
        string_val: "literary"
        string_val: "excellence"
        string_val: "dumas"
        string_val: "flaubert"
        string_val: "balzac"
        string_val: "maupassant"
        string_val: "churn"
        string_val: "tosh"
        string_val: "nouvelle"
        string_val: "vague"
        string_val: "cinematic"
        string_val: "movement"
        string_val: "until"
        string_val: "20th"
        string_val: "century"
        string_val: "france"
        string_val: "tradition"
        string_val: "artistic"
        string_val: "lucidity"
        string_val: "clever"
        string_val: "philosophy"
        string_val: "minute"
        string_val: "hand"
        string_val: "camera"
        string_val: "start"
        string_val: "wooohooo"
        string_val: "weird"
        string_val: "theme"
        string_val: "pshaw"
        string_val: "let"
        string_val: "amusement"
        string_val: "park"
        string_val: "ride"
        string_val: "going"
        string_val: "waterdance"
        string_val: "1991"
        string_val: "main"
        string_val: "character"
        string_val: "played"
        string_val: "eric"
        string_val: "stoltz"
        string_val: "finds"
        string_val: "himself"
        string_val: "rehab"
        string_val: "center"
        string_val: "others"
        string_val: "similarly"
        string_val: "injured"
        string_val: "harsh"
        string_val: "confined"
        string_val: "wheelchair"
        string_val: "interesting"
        string_val: "promising"
        string_val: "premise"
        string_val: "fails"
        string_val: "deploy"
        string_val: "ensues"
        string_val: "instead"
        string_val: "largely"
        string_val: "hollywood"
        string_val: "schmaltz"
        string_val: "moments"
        string_val: "william"
        string_val: "forsythe"
        string_val: "wesley"
        string_val: "snipes"
        string_val: "et"
        string_val: "al"
        string_val: "brilliant"
        string_val: "perform"
        string_val: "honestly"
        string_val: "before"
        string_val: "heard"
        string_val: "many"
        string_val: "people"
        string_val: "said"
        string_val: "disgrace"
        string_val: "since"
        string_val: "morgan"
        string_val: "freeman"
        string_val: "kevin"
        string_val: "spacey"
        string_val: "taken"
        string_val: "roles"
        string_val: "own"
        string_val: "apparently"
        string_val: "right"
        string_val: "disappointed"
        string_val: "wondering"
        string_val: "during"
        string_val: "hell"
        string_val: "watch"
        string_val: "course"
        string_val: "expecting"
        string_val: "justin"
        string_val: "come"
        string_val: "tina"
        string_val: "fey"
        string_val: "do"
        string_val: "soon"
        string_val: "started"
        string_val: "knew"
        string_val: "sure"
        string_val: "even"
        string_val: "laugh"
        string_val: "loud"
        string_val: "laughs"
        string_val: "recommend"
        string_val: "buying"
        string_val: "renting"
        string_val: "thats"
        string_val: "baby"
        string_val: "mama"
        string_val: "scenes"
        string_val: "heartwarming"
        string_val: "ending"
        string_val: "strives"
        string_val: "release"
        string_val: "1983"
        string_val: "christmas"
        string_val: "jean"
        string_val: "shepherd"
        string_val: "narrated"
        string_val: "alter"
        string_val: "ego"
        string_val: "ralphie"
        string_val: "become"
        string_val: "true"
        string_val: "summer"
        string_val: "narrator"
        string_val: "none"
        string_val: "charm"
        string_val: "nowhere"
        string_val: "near"
        string_val: "caliber"
        string_val: "basically"
        string_val: "mishmash"
        string_val: "mediocre"
        string_val: "plain"
        string_val: "stories"
        string_val: "include"
        string_val: "hillbilly"
        string_val: "neighbors"
        string_val: "battling"
        string_val: "tops"
        string_val: "charles"
        string_val: "grodin"
        string_val: "honest"
        string_val: "pretty"
        string_val: "influence"
        string_val: "viewings"
        string_val: "likely"
        string_val: "defiance"
        string_val: "bullwhip"
        string_val: "viewing"
        string_val: "anyway"
        string_val: "rhonda"
        string_val: "fleming"
        string_val: "those"
        string_val: "gorgeous"
        string_val: "eyes"
        string_val: "interested"
        string_val: "picture"
        string_val: "morally"
        string_val: "dubious"
        string_val: "richard"
        string_val: "pryor"
        string_val: "rosey"
        string_val: "grier"
        string_val: "curious"
        string_val: "ww2"
        string_val: "serves"
        string_val: "statement"
        string_val: "racism"
        string_val: "understand"
        string_val: "reflect"
        string_val: "feel"
        string_val: "issues"
        string_val: "produced"
        string_val: "period"
        string_val: "portray"
        string_val: "meaning"
        string_val: "70"
        string_val: "40"
        string_val: "7"
        string_val: "seven"
        string_val: "men"
        string_val: "ok"
        string_val: "re"
        string_val: "bastketball"
        string_val: "diaries"
        string_val: "completely"
        string_val: "revolves"
        string_val: "around"
        string_val: "max"
        string_val: "younger"
        string_val: "major"
        string_val: "cocaine"
        string_val: "addiction"
        string_val: "adam"
        string_val: "eldest"
        string_val: "doctor"
        string_val: "suppose"
        string_val: "plunge"
        string_val: "reality"
        string_val: "extreme"
        string_val: "lows"
        string_val: "drugs"
        string_val: "possible"
        string_val: "fun"
        string_val: "matter"
        string_val: "situation"
        string_val: "happens"
        string_val: "present"
        string_val: "focus"
        string_val: "killer"
        string_val: "tomatoes"
        string_val: "humor"
        string_val: "either"
        string_val: "love"
        string_val: "hate"
        string_val: "personally"
        string_val: "fourth"
        string_val: "feeling"
        string_val: "gone"
        string_val: "aren"
        string_val: "jokes"
        string_val: "lame"
        string_val: "supposed"
        string_val: "now"
        string_val: "following"
        string_val: "shouldn"
        string_val: "huge"
        string_val: "fan"
        string_val: "ivan"
        string_val: "reitman"
        string_val: "loved"
        string_val: "evolution"
        string_val: "ghostbusters"
        string_val: "trailer"
        string_val: "uma"
        string_val: "will"
        string_val: "dumped"
        string_val: "luke"
        string_val: "build"
        string_val: "obviously"
        string_val: "moment"
        string_val: "unleashes"
        string_val: "superpowers"
        string_val: "him"
        string_val: "pay"
        string_val: "shark"
        string_val: "tossing"
        string_val: "manage"
        string_val: "slight"
        string_val: "giggle"
        string_val: "twist"
        string_val: "nearly"
        string_val: "avenging"
        string_val: "elm"
        string_val: "street"
        string_val: "children"
        string_val: "freddy"
        string_val: "effects"
        string_val: "actual"
        string_val: "development"
        string_val: "simply"
        string_val: "insulting"
        string_val: "scary"
        string_val: "nope"
        string_val: "lately"
        string_val: "realize"
        string_val: "playing"
        string_val: "stupid"
        string_val: "nowadays"
        string_val: "down"
        string_val: "station"
        string_val: "bring"
        string_val: "update"
        string_val: "skits"
        string_val: "burlesque"
        string_val: "stage"
        string_val: "string"
        string_val: "several"
        string_val: "your"
        string_val: "grandmother"
        string_val: "fairly"
        string_val: "safe"
        string_val: "bet"
        string_val: "tries"
        string_val: "too"
        string_val: "rent"
        string_val: "remember"
        string_val: "older"
        string_val: "though"
        string_val: "consider"
        string_val: "myself"
        string_val: "science"
        string_val: "fiction"
        string_val: "difficult"
        string_val: "take"
        string_val: "seriously"
        string_val: "amc"
        string_val: "late"
        string_val: "night"
        string_val: "glad"
        string_val: "free"
        string_val: "few"
        string_val: "average"
        string_val: "awful"
        string_val: "mars"
        string_val: "okay"
        string_val: "got"
        string_val: "back"
        string_val: "review"
        string_val: "negative"
        string_val: "actually"
        string_val: "liking"
        string_val: "clich"
        string_val: "imaginable"
        string_val: "tj"
        string_val: "hooker"
        string_val: "adrian"
        string_val: "zmed"
        string_val: "sequel"
        string_val: "went"
        string_val: "through"
        string_val: "thinking"
        string_val: "spoof"
        string_val: "came"
        string_val: "wild"
        string_val: "wacky"
        string_val: "motorcycle"
        string_val: "notice"
        string_val: "patricia"
        string_val: "birch"
        string_val: "directs"
        string_val: "sadly"
        string_val: "realized"
        string_val: "kick"
        string_val: "opposing"
        string_val: "gang"
        string_val: "lost"
        string_val: "wheels"
        string_val: "due"
        string_val: "gambling"
        string_val: "holding"
        string_val: "grudge"
        string_val: "against"
        string_val: "theatre"
        string_val: "producer"
        string_val: "person"
        string_val: "told"
        string_val: "shame"
        string_val: "sarah"
        string_val: "michelle"
        string_val: "geller"
        string_val: "putting"
        string_val: "poor"
        string_val: "excuse"
        string_val: "may"
        string_val: "japanese"
        string_val: "spoken"
        string_val: "act"
        string_val: "english"
        string_val: "boo"
        string_val: "l"
        string_val: "garbage"
        string_val: "girls"
        string_val: "rocks"
        string_val: "brains"
        string_val: "agreeing"
        string_val: "faint"
        string_val: "heavens"
        string_val: "hired"
        string_val: "below"
        string_val: "standard"
        string_val: "unbearable"
        string_val: "contemplating"
        string_val: "please"
        string_val: "credit"
        string_val: "buff"
        string_val: "worse"
        string_val: "attack"
        string_val: "green"
        string_val: "ring"
        string_val: "silent"
        string_val: "1927"
        string_val: "stars"
        string_val: "boxers"
        string_val: "comes"
        string_val: "loves"
        string_val: "boxer"
        string_val: "known"
        string_val: "round"
        string_val: "jack"
        string_val: "champion"
        string_val: "along"
        string_val: "marries"
        string_val: "starts"
        string_val: "overtly"
        string_val: "flirting"
        string_val: "climactic"
        string_val: "final"
        string_val: "boxing"
        string_val: "fight"
        string_val: "wasn"
        string_val: "massochist"
        string_val: "survived"
        string_val: "cost"
        string_val: "1000"
        string_val: "brought"
        string_val: "horrid"
        string_val: "3rd"
        string_val: "graders"
        string_val: "read"
        string_val: "lines"
        string_val: "second"
        string_val: "reason"
        string_val: "skin"
        string_val: "sorely"
        string_val: "lacking"
        string_val: "seems"
        string_val: "middle"
        string_val: "ground"
        string_val: "rhine"
        string_val: "concerned"
        string_val: "applauding"
        string_val: "sincerity"
        string_val: "liberal"
        string_val: "view"
        string_val: "fine"
        string_val: "loathes"
        string_val: "obvious"
        string_val: "propaganda"
        string_val: "cardboard"
        string_val: "overall"
        string_val: "tendentiousness"
        string_val: "fall"
        string_val: "latter"
        string_val: "category"
        string_val: "concerning"
        string_val: "activities"
        string_val: "european"
        string_val: "refugees"
        string_val: "washington"
        string_val: "wartime"
        string_val: "crushing"
        string_val: "bore"
        string_val: "worthwhile"
        string_val: "mostly"
        string_val: "sunday"
        string_val: "waiting"
        string_val: "advertised"
        string_val: "tv"
        string_val: "10"
        string_val: "passed"
        string_val: "30"
        string_val: "ended"
        string_val: "echance"
        string_val: "someone"
        string_val: "tickle"
        string_val: "90"
        string_val: "kinda"
        string_val: "becomes"
        string_val: "bit"
        string_val: "goes"
        string_val: "rails"
        string_val: "sort"
        string_val: "wants"
        string_val: "boogie"
        string_val: "nights"
        string_val: "achieve"
        string_val: "stayed"
        string_val: "quarter"
        string_val: "seeing"
        string_val: "murder"
        string_val: "mystery"
        string_val: "medical"
        string_val: "examiner"
        string_val: "investigates"
        string_val: "friend"
        string_val: "mysterious"
        string_val: "car"
        string_val: "accident"
        string_val: "complete"
        string_val: "receipt"
        string_val: "lack"
        string_val: "drama"
        string_val: "remembered"
        string_val: "pax"
        string_val: "notable"
        string_val: "dishing"
        string_val: "budgeted"
        string_val: "campy"
        string_val: "ninteen"
        string_val: "eighty"
        string_val: "four"
        string_val: "futuristic"
        string_val: "society"
        string_val: "government"
        string_val: "controls"
        string_val: "everything"
        string_val: "trusted"
        string_val: "dark"
        string_val: "yourself"
        string_val: "romance"
        string_val: "taking"
        string_val: "place"
        string_val: "betrayal"
        string_val: "lovers"
        string_val: "human"
        string_val: "nature"
        string_val: "self"
        string_val: "centred"
        string_val: "ideas"
        string_val: "portraying"
        string_val: "repugnant"
        string_val: "bronson"
        string_val: "thriller"
        string_val: "technically"
        string_val: "utterly"
        string_val: "vile"
        string_val: "inconceivable"
        string_val: "call"
        string_val: "entertainment"
        string_val: "disturbing"
        string_val: "jumped"
        string_val: "chance"
        string_val: "uncut"
        string_val: "uninterrupted"
        string_val: "remembering"
        string_val: "rahs"
        string_val: "raves"
        string_val: "wherever"
        string_val: "slip"
        string_val: "truly"
        string_val: "backed"
        string_val: "somewhere"
        string_val: "dripping"
        string_val: "water"
        string_val: "throughout"
        string_val: "house"
        string_val: "rain"
        string_val: "prophetic"
        string_val: "dreams"
        string_val: "turn"
        string_val: "raw"
        string_val: "sewage"
        string_val: "dropped"
        string_val: "work"
        string_val: "scream"
        string_val: "disappointment"
        string_val: "chamberlain"
        string_val: "expressionless"
        string_val: "mask"
        string_val: "offered"
        string_val: "russ"
        string_val: "left"
        string_val: "behind"
        string_val: "reappear"
        string_val: "begin"
